Repository: SopaDePo1lo/process-manager
Catalog: locales/*/LC_MESSAGES/*.po
Languages: es, ru, uz

source: help - displays all commands info - outputs info of all the current processes create - create a process manager add - add a new process to ProcessManager setQuant - set the quant value fcfs - runs FCFS algorithm for ProcessManager sjf - runs SJF algorithm for ProcessManager rrFcfs - runs RR FCFS algorithm for ProcessManager rrSjf - runs RR SJF algorithm for ProcessManager exit - exits app clear - clear terminal edit - edit processes language - change language
es: help-muestra todos los comandos info-salidas de información de todos los procesos actuales create-crear un gestor de procesos add-añadir un nuevo proceso al Gestor de procesos set Quant-establecer el valor cuantitativo fcfs - ejecuta el algoritmo FCFS para el Gestor de procesos sjf - ejecuta el algoritmo SJF para el Gestor de procesos rrFcfs - ejecuta el algoritmo RR FCFS para el Gestor de procesos rrSjf - ejecuta el algoritmo RR SJF para el Gestor de procesos exit-aplicación de salidas terminal transparente - transparente editar - editar procesos idioma-cambiar idioma
ru: help - вывод всех команд info - вывод информации о процессах create - создать ProcessManager add - добавить процесс в ProcessManager setQuant - установить новую величину кванта fcfs - рисует график исполнения алгоритма FCFS ProcessManager sjf - рисует график исполнения алгоритма SJF ProcessManager rrFcfs - рисует график исполнения алгоритма RR+FCFS ProcessManager rrSjf - рисует график исполнения алгоритма RR+SJF ProcessManager exit - выход clear - очистить терминал edit - изменить значение процесса language - поменять язык
uz: help - barcha buyruqlarni ko'rsatadi info - barcha joriy jarayonlar haqida ma'lumot chiqaradi create - jarayon menejerini yaratish add - jarayon menejeriga yangi jarayon qo'shish setQuant - kvant qiymatini o'rnating fcfs - jarayon menejeri uchun FCFS algoritm ishlaydi sjf - jarayoni menejeri uchun SJF algoritmi ishlaydi rrfcfs - jarayon menejeri uchun RR FCFS algoritm ishlaydi rrsjf - jarayoni menejeri uchun RR SJF algoritmi ishlaydi exir - chiqishclear - aniq terminal edit - jarayonlarni tahrirlash language - tilni o'zgartirish

source: You must create a ProcessManager first
es: Primero debe crear un ProcessManager
ru: ProcessManager не создан
uz: Avval jarayon menejerini yaratishingiz kerak

source: Enter preferred language(ru, en):
uz: Afzal tilni kiriting(ru, en):

source: Enter amount of processes:
es: Introduzca la cantidad de procesos:
ru: Введите количество процессов:
uz: Jarayonlar miqdorini kiriting:

source: Enter value of quant:
es: Introduzca el valor de la cantidad:
ru: Введите величину кванта:
uz: Kvant qiymatini kiriting:

source: Enter process priority:
es: Ingrese la prioridad del proceso:
ru: Введите новое значение приоритета:
uz: Jarayon ustuvorligini kiriting:

source: Cant find a process with that index
es: No se puede encontrar un proceso con ese índice
ru: Процесс не найден
uz: Ushbu indeks bilan jarayonni topa olmayapman

source: Enter config file name:
es: Introduzca el nombre del archivo de configuración:
ru: Введите название config файла:
uz: Config fayl nomini kiriting:

source: File not found
es: Archivo no encontrado
ru: Файл не найден
uz: Fayl topilmadi

source: Enter process id:
es: Introduzca el índice (número) del proceso:
ru: Введите индекс(номер) процесса:
uz: Jarayon identifikatorini kiriting:

source: Enter CPU Burst:
es: Introduzca el valor de CPU Burst:
ru: Введите величину CPU Burst:
uz: CPU portlash kiriting:

source: Enter CPU Burst (leave empty for random):
uz: CPU Burrs kiriting (tasodifiy uchun bo'sh qoldiring):

source: Enter process priority (leave empty for random):
es: Ingrese el valor de prioridad del proceso (deje en blanco para el random):
ru: Введите величину приоритета процесса (оставьте пустым для рандома):
uz: Jarayon ustuvorligini kiriting (tasodifiy uchun bo'sh qoldiring):

source: Exiting programm
es: Programas existentes
ru: Выход из программы
uz: Mavjud dasturlar

source: Enter CPU Burts (leave empty for random):
es: Introduzca el valor de CPU Burst:
ru: Введите величину CPU Burst (оставьте пустым для рандома):
